Revit 2027 API
FillPattern.Target Property
 Target of this fill pattern applied to.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FillPatternTarget Target { get; set; }
Public Property Target As FillPatternTarget
	Get
	Set
public:
property FillPatternTarget Target {
	FillPatternTarget get ();
	void set (FillPatternTarget value);
}
member Target : FillPatternTarget with get, set
Property Value
FillPatternTarget
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
FillPattern Class
Autodesk.Revit.DB Namespace